scripts/load-test.yml
# Artillery Load Test Configuration for ANDE Chain Testnet
# Professional load testing for RPC endpoints

config:
  target: "http://localhost:8545"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 10
      name: "Warm-up"

    # Ramp-up phase
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up"

    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"

    # Spike test phase
    - duration: 60
      arrivalRate: 100
      name: "Spike test"

    # Cool-down phase
    - duration: 60
      arrivalRate: 50
      rampTo: 10
      name: "Cool-down"

  # Load testing environment
  environments:
    testnet:
      target: "http://localhost:8545"

    production:
      target: "https://rpc.andechain.com"

  # Plugin configurations
  plugins:
    expect: {}
    metrics-by-endpoint: {}

  # Performance thresholds
  ensure:
    maxErrorRate: 1
    p95: 1000  # 95th percentile latency under 1000ms
    p99: 2000  # 99th percentile latency under 2000ms

  # HTTP defaults
  http:
    timeout: 10

scenarios:
  # Scenario 1: Basic RPC calls
  - name: "Basic RPC Calls"
    weight: 30
    flow:
      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            method: "eth_blockNumber"
            params: []
            id: 1
          expect:
            - statusCode: 200
            - hasProperty: result

      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            method: "eth_chainId"
            params: []
            id: 2
          expect:
            - statusCode: 200
            - hasProperty: result

      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            method: "net_version"
            params: []
            id: 3
          expect:
            - statusCode: 200
            - hasProperty: result

  # Scenario 2: Block queries
  - name: "Block Queries"
    weight: 25
    flow:
      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            method: "eth_getBlockByNumber"
            params: ["latest", false]
            id: 10
          expect:
            - statusCode: 200
            - hasProperty: result

      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            method: "eth_getBlockByNumber"
            params: ["0x1", true]
            id: 11
          expect:
            - statusCode: 200
            - hasProperty: result

  # Scenario 3: Account balance queries
  - name: "Account Queries"
    weight: 20
    flow:
      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            method: "eth_getBalance"
            params: ["0xf39Fd6e51aad88F6F4ce6aB8827279cffFb92266", "latest"]
            id: 20
          expect:
            - statusCode: 200
            - hasProperty: result

      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            method: "eth_getTransactionCount"
            params: ["0xf39Fd6e51aad88F6F4ce6aB8827279cffFb92266", "latest"]
            id: 21
          expect:
            - statusCode: 200
            - hasProperty: result

  # Scenario 4: Gas price queries
  - name: "Gas Price Queries"
    weight: 15
    flow:
      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            method: "eth_gasPrice"
            params: []
            id: 30
          expect:
            - statusCode: 200
            - hasProperty: result

      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            method: "eth_estimateGas"
            params:
              - from: "0xf39Fd6e51aad88F6F4ce6aB8827279cffFb92266"
                to: "0x70997970C51812dc3A010C7d01b50e0d17dc79C8"
                value: "0xde0b6b3a7640000"
            id: 31
          expect:
            - statusCode: 200

  # Scenario 5: Transaction pool queries
  - name: "Transaction Pool Queries"
    weight: 10
    flow:
      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            method: "txpool_status"
            params: []
            id: 40
          expect:
            - statusCode: 200
            - hasProperty: result

      - post:
          url: "/"
          json:
            jsonrpc: "2.0"
            method: "txpool_inspect"
            params: []
            id: 41
          expect:
            - statusCode: 200

# Custom metrics
after:
  flow:
    - log: "Load test completed"